-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: Dec 19, 2025 at 08:43 AM
-- Server version: 11.8.3-MariaDB-log
-- PHP Version: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `u528206822_10dance`
--
CREATE DATABASE IF NOT EXISTS `u528206822_10dance` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci;
USE `u528206822_10dance`;

-- --------------------------------------------------------

--
-- Table structure for table `attendees`
--

CREATE TABLE `attendees` (
  `id` int(10) UNSIGNED NOT NULL,
  `event_id` int(10) UNSIGNED NOT NULL,
  `tz_id` varchar(9) NOT NULL,
  `first_name` varchar(100) NOT NULL,
  `last_name` varchar(100) NOT NULL,
  `institute` varchar(255) NOT NULL,
  `is_arrive` tinyint(1) DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `attendees`
--

INSERT INTO `attendees` (`id`, `event_id`, `tz_id`, `first_name`, `last_name`, `institute`, `is_arrive`, `created_at`) VALUES
(3, 1, '298374615', 'משה', 'שוני', 'אוניברסיטת חיפה', 0, '2025-12-10 20:39:53'),
(4, 1, '329518746', 'מאיה', 'פרידמן', 'אוניברסיטת בן גוריון', 0, '2025-12-10 20:39:53'),
(5, 1, '451982637', 'עמרי', 'ברק', 'הטכניון', 0, '2025-12-10 20:39:53'),
(6, 1, '512783964', 'תמר', 'רוזן', 'מכללת הדסה', 0, '2025-12-10 20:39:53'),
(7, 1, '623498157', 'שחר', 'בן יוסף', 'מכללת אחווה', 0, '2025-12-10 20:39:53'),
(8, 1, '734185926', 'עדי', 'שמעוני', 'המכללה למנהל', 0, '2025-12-10 20:39:53'),
(9, 1, '845219673', 'גל', 'שטרן', 'מכללת ספיר', 0, '2025-12-10 20:39:53'),
(10, 1, '956731842', 'אורי', 'אלבז', 'מכללת שערי משפט', 0, '2025-12-10 20:39:53'),
(11, 1, '038475192', 'אופיר', 'כהנא', 'אוניברסיטת בר אילן', 0, '2025-12-10 20:39:53'),
(12, 1, '149283576', 'יובל', 'שחר', 'מכללת רופין', 0, '2025-12-10 20:39:53'),
(13, 1, '250394861', 'רועי', 'בן חיים', 'האוניברסיטה הפתוחה', 0, '2025-12-10 20:39:53'),
(14, 1, '361587492', 'דנה', 'זיו', 'אוניברסיטת תל אביב', 0, '2025-12-10 20:39:53'),
(15, 1, '472698153', 'אביתר', 'לוין', 'אוניברסיטת בן גוריון', 0, '2025-12-10 20:39:53'),
(16, 1, '583719624', 'נטע', 'זילברמן', 'הטכניון', 0, '2025-12-10 20:39:53'),
(17, 1, '694820315', 'אלעד', 'אברמוב', 'מכללת ספיר', 0, '2025-12-10 20:39:53'),
(18, 1, '705931486', 'שיר', 'חיון', 'מכללת אחווה', 0, '2025-12-10 20:39:53'),
(19, 1, '816042579', 'טל', 'וייס', 'האוניברסיטה העברית בירושלים', 0, '2025-12-10 20:39:53'),
(20, 1, '927153468', 'מירי', 'חג\'ג', 'אוניברסיטת חיפה', 0, '2025-12-10 20:39:53'),
(21, 1, '019283574', 'צור', 'סגל', 'מכללת הדסה', 0, '2025-12-10 20:39:53'),
(22, 1, '120394856', 'מיכל', 'דנון', 'המכללה למנהל', 0, '2025-12-10 20:39:53'),
(23, 1, '231485967', 'עידו', 'רבינוביץ', 'מכללת רופין', 0, '2025-12-10 20:39:53'),
(24, 1, '342596718', 'שקד', 'אביטן', 'אוניברסיטת בר אילן', 0, '2025-12-10 20:39:53'),
(25, 1, '453617829', 'תאיר', 'כהן', 'אוניברסיטת תל אביב', 0, '2025-12-10 20:39:53'),
(26, 1, '564728931', 'אביב', 'שושן', 'אוניברסיטת חיפה', 0, '2025-12-10 20:39:53'),
(27, 1, '675839142', 'עידן', 'צמח', 'אוניברסיטת בן גוריון', 0, '2025-12-10 20:39:53'),
(28, 1, '786940253', 'מאיר', 'לוי', 'מכללת הדסה', 0, '2025-12-10 20:39:53'),
(29, 1, '897051364', 'רומי', 'אלון', 'מכללת אחווה', 0, '2025-12-10 20:39:53'),
(30, 1, '908162475', 'אסף', 'שלומי', 'מכללת ספיר', 0, '2025-12-10 20:39:53'),
(31, 1, '041692753', 'שירה', 'טולדנו', 'הטכניון', 0, '2025-12-10 20:39:53'),
(32, 1, '152703864', 'עומר', 'בועז', 'האוניברסיטה העברית בירושלים', 0, '2025-12-10 20:39:53'),
(33, 1, '263814975', 'ליאן', 'קמחי', 'אוניברסיטת תל אביב', 0, '2025-12-10 20:39:53'),
(34, 1, '374925186', 'יהונתן', 'לביא', 'אוניברסיטת בר אילן', 0, '2025-12-10 20:39:53'),
(35, 1, '485036297', 'רוי', 'קרן', 'מכללת הדסה', 0, '2025-12-10 20:39:53'),
(36, 1, '596147308', 'תום', 'מור', 'מכללת רופין', 0, '2025-12-10 20:39:53'),
(37, 1, '617258419', 'עטר', 'חביב', 'מכללת ספיר', 0, '2025-12-10 20:39:53'),
(38, 1, '728369520', 'ניצן', 'ממן', 'המכללה למנהל', 0, '2025-12-10 20:39:53'),
(39, 1, '839470631', 'אביגיל', 'נאור', 'אוניברסיטת חיפה', 0, '2025-12-10 20:39:53'),
(40, 1, '940581742', 'גפן', 'בוהדנה', 'אוניברסיטת בן גוריון', 0, '2025-12-10 20:39:53'),
(41, 1, '053718264', 'ירין', 'זוהר', 'אוניברסיטת תל אביב', 0, '2025-12-10 20:39:53'),
(42, 1, '164829375', 'שקד', 'ביטון', 'האוניברסיטה העברית בירושלים', 0, '2025-12-10 20:39:53'),
(43, 1, '275930486', 'אורי', 'רוזנבלום', 'מכללת אחווה', 0, '2025-12-10 20:39:53'),
(44, 1, '386041597', 'עדן', 'פנחס', 'מכללת הדסה', 0, '2025-12-10 20:39:53'),
(45, 1, '497152608', 'רוני', 'ממן', 'הטכניון', 0, '2025-12-10 20:39:53'),
(46, 1, '518263719', 'עטרי', 'שושן', 'אוניברסיטת חיפה', 0, '2025-12-10 20:39:53'),
(47, 1, '629374820', 'אריאל', 'מור יוסף', 'אוניברסיטת תל אביב', 0, '2025-12-10 20:39:53'),
(48, 1, '730485931', 'יעל', 'שדה', 'מכללת הדסה', 0, '2025-12-10 20:39:53'),
(49, 1, '841596042', 'אור', 'בוכריס', 'אוניברסיטת בן גוריון', 0, '2025-12-10 20:39:53'),
(50, 1, '952607153', 'דניאלה', 'אבוחצירא', 'מכללת רופין', 0, '2025-12-10 20:39:53'),
(51, 1, '064829315', 'תמיר', 'כפיר', 'אוניברסיטת בר אילן', 0, '2025-12-10 20:39:53'),
(52, 1, '175930426', 'הדר', 'דדון', 'מכללת ספיר', 0, '2025-12-10 20:39:53'),
(53, 1, '286041537', 'עופרי', 'זוהר', 'המכללה למנהל', 0, '2025-12-10 20:39:53'),
(54, 1, '397152648', 'נועם', 'גולן', 'האוניברסיטה הפתוחה', 0, '2025-12-10 20:39:53'),
(55, 1, '408263759', 'לירז', 'בן שבת', 'אוניברסיטת תל אביב', 0, '2025-12-10 20:39:53'),
(56, 1, '519374860', 'שיראל', 'רוזנטל', 'אוניברסיטת חיפה', 0, '2025-12-10 20:39:53'),
(57, 1, '620485971', 'דניס', 'קדוש', 'הטכניון', 0, '2025-12-10 20:39:53'),
(58, 1, '731596082', 'רועי', 'ליבוביץ', 'מכללת אחווה', 0, '2025-12-10 20:39:53'),
(59, 1, '842607193', 'יוכבד', 'חדד', 'אוניברסיטת בן גוריון', 0, '2025-12-10 20:39:53'),
(60, 1, '953718204', 'אביתר', 'בן הרוש', 'האוניברסיטה העברית בירושלים', 0, '2025-12-10 20:39:53'),
(61, 1, '075930416', 'ליאורה', 'ששון', 'מכללת הדסה', 0, '2025-12-10 20:39:53'),
(62, 1, '186041527', 'שקד', 'צור', 'אוניברסיטת תל אביב', 0, '2025-12-10 20:39:53'),
(63, 1, '297152638', 'אוראל', 'פרץ', 'אוניברסיטת בר אילן', 0, '2025-12-10 20:39:53'),
(64, 1, '308263749', 'ליאן', 'אלמקייס', 'אוניברסיטת בן גוריון', 0, '2025-12-10 20:39:53'),
(65, 1, '419374860', 'דולב', 'סולמון', 'מכללת ספיר', 0, '2025-12-10 20:39:53'),
(66, 1, '520485971', 'מאי', 'שריקי', 'המכללה למנהל', 0, '2025-12-10 20:39:53'),
(67, 1, '631596082', 'אורין', 'יצחקי', 'אוניברסיטת חיפה', 0, '2025-12-10 20:39:53'),
(68, 1, '742607193', 'אמיר', 'סרוסי', 'אוניברסיטת תל אביב', 0, '2025-12-10 20:39:53'),
(69, 1, '853718204', 'יהב', 'קורן', 'הטכניון', 0, '2025-12-10 20:39:53'),
(70, 1, '964829315', 'מאור', 'גבע', 'האוניברסיטה העברית בירושלים', 0, '2025-12-10 20:39:53'),
(73, 5, '100000025', 'עומר', 'מזרחי', 'אוניברסיטת חיפה', 0, '2025-12-10 21:11:05'),
(74, 5, '100000033', 'מאיה', 'פרידמן', 'אוניברסיטת בן גוריון', 0, '2025-12-10 21:11:05'),
(75, 5, '100000041', 'יואב', 'ברק', 'הטכניון', 0, '2025-12-10 21:11:05'),
(76, 5, '100000058', 'תמר', 'רוזן', 'מכללת הדסה', 0, '2025-12-10 21:11:05'),
(77, 5, '100000066', 'רוני', 'בן יוסף', 'מכללת אחווה', 0, '2025-12-10 21:11:05'),
(78, 5, '100000074', 'שחר', 'שמעוני', 'המכללה למנהל', 0, '2025-12-10 21:11:05'),
(79, 5, '100000082', 'יעל', 'שטרן', 'מכללת ספיר', 0, '2025-12-10 21:11:05'),
(80, 5, '100000090', 'ליאור', 'אלבז', 'מכללת רופין', 0, '2025-12-10 21:11:05'),
(81, 5, '100000108', 'גאיה', 'כהנא', 'האוניברסיטה העברית בירושלים', 0, '2025-12-10 21:11:05'),
(82, 5, '100000116', 'גיא', 'שחר', 'אוניברסיטת תל אביב', 0, '2025-12-10 21:11:05'),
(83, 5, '100000124', 'אורי', 'בן חיים', 'אוניברסיטת חיפה', 0, '2025-12-10 21:11:05'),
(84, 5, '100000132', 'רועי', 'זיו', 'אוניברסיטת בן גוריון', 0, '2025-12-10 21:11:05'),
(85, 5, '100000140', 'אדל', 'לוין', 'הטכניון', 0, '2025-12-10 21:11:05'),
(86, 5, '100000157', 'יובל', 'זילברמן', 'מכללת הדסה', 0, '2025-12-10 21:11:05'),
(87, 5, '100000165', 'דנה', 'אברמוב', 'מכללת אחווה', 0, '2025-12-10 21:11:05'),
(88, 5, '100000173', 'איתי', 'חיון', 'המכללה למנהל', 0, '2025-12-10 21:11:05'),
(89, 5, '100000181', 'ליאן', 'וייס', 'מכללת ספיר', 0, '2025-12-10 21:11:05'),
(90, 5, '100000199', 'ליאם', 'חג\'ג', 'מכללת רופין', 0, '2025-12-10 21:11:05'),
(91, 5, '100000207', 'עמית', 'סגל', 'האוניברסיטה העברית בירושלים', 0, '2025-12-10 21:11:05'),
(92, 5, '100000215', 'טל', 'דנון', 'אוניברסיטת תל אביב', 0, '2025-12-10 21:11:05'),
(93, 5, '100000223', 'אביגיל', 'רבינוביץ', 'אוניברסיטת חיפה', 0, '2025-12-10 21:11:05'),
(94, 5, '100000231', 'אריאל', 'אביטן', 'אוניברסיטת בן גוריון', 0, '2025-12-10 21:11:05'),
(95, 5, '100000249', 'אלון', 'שושן', 'הטכניון', 0, '2025-12-10 21:11:05'),
(96, 5, '100000256', 'אליה', 'צמח', 'מכללת הדסה', 0, '2025-12-10 21:11:05'),
(97, 5, '100000264', 'רומי', 'לוי', 'מכללת אחווה', 0, '2025-12-10 21:11:05'),
(98, 5, '100000272', 'נטע', 'אלון', 'המכללה למנהל', 0, '2025-12-10 21:11:05'),
(99, 5, '100000280', 'עדן', 'שלומי', 'מכללת ספיר', 0, '2025-12-10 21:11:05'),
(100, 5, '100000298', 'נועם', 'טולדנו', 'מכללת רופין', 0, '2025-12-10 21:11:05'),
(101, 5, '100000306', 'גפן', 'בועז', 'האוניברסיטה העברית בירושלים', 0, '2025-12-10 21:11:05'),
(102, 5, '100000314', 'עדי', 'קמחי', 'אוניברסיטת תל אביב', 0, '2025-12-10 21:11:05'),
(103, 5, '100000322', 'מיכל', 'לביא', 'אוניברסיטת חיפה', 0, '2025-12-10 21:11:05'),
(104, 5, '100000330', 'תום', 'קרן', 'אוניברסיטת בן גוריון', 0, '2025-12-10 21:11:05'),
(105, 5, '100000348', 'עמנואל', 'מור', 'הטכניון', 0, '2025-12-10 21:11:05'),
(106, 5, '100000355', 'ליה', 'חביב', 'מכללת הדסה', 0, '2025-12-10 21:11:05'),
(107, 5, '100000363', 'עומרי', 'ממן', 'מכללת אחווה', 0, '2025-12-10 21:11:05'),
(108, 5, '100000371', 'שיר', 'נאור', 'המכללה למנהל', 0, '2025-12-10 21:11:05'),
(109, 5, '100000389', 'אמה', 'בוהדנה', 'מכללת ספיר', 0, '2025-12-10 21:11:05'),
(110, 5, '100000397', 'יונתן', 'זוהר', 'מכללת רופין', 0, '2025-12-10 21:11:05'),
(111, 5, '100000405', 'שקד', 'ביטון', 'האוניברסיטה העברית בירושלים', 0, '2025-12-10 21:11:05'),
(112, 5, '100000413', 'הדס', 'רוזנבלום', 'אוניברסיטת תל אביב', 0, '2025-12-10 21:11:05'),
(113, 5, '100000421', 'יאיר', 'פנחס', 'אוניברסיטת חיפה', 0, '2025-12-10 21:11:05'),
(114, 5, '100000439', 'רעות', 'ממן', 'אוניברסיטת בן גוריון', 0, '2025-12-10 21:11:05'),
(115, 5, '100000447', 'ליהיא', 'יוסף', 'הטכניון', 0, '2025-12-10 21:11:05'),
(116, 5, '100000454', 'יוסי', 'ליבוביץ', 'מכללת הדסה', 0, '2025-12-10 21:11:05'),
(117, 5, '100000462', 'מרים', 'חדד', 'מכללת אחווה', 0, '2025-12-10 21:11:05'),
(118, 5, '100000470', 'דור', 'בן הרוש', 'המכללה למנהל', 0, '2025-12-10 21:11:05'),
(119, 5, '100000488', 'מאור', 'ששון', 'מכללת ספיר', 0, '2025-12-10 21:11:05'),
(120, 5, '100000496', 'אביתר', 'פרץ', 'מכללת רופין', 0, '2025-12-10 21:11:05'),
(123, 1, '298374615', 'יואב', 'יוגכעגכעגדעכ', 'המללה האקדמית עמק יזרעל', 1, '2025-12-13 19:50:52'),
(124, 1, '298374615', 'יואב', 'יוגכעגכעגדעכ', 'המללה האקדמית עמק יזרעל', 1, '2025-12-13 19:51:27'),
(125, 0, '', '', '', '', 1, '2025-12-13 19:55:56'),
(126, 0, '', '', '', '', 1, '2025-12-13 19:56:36'),
(127, 0, '', '', '', '', 1, '2025-12-13 20:03:42'),
(128, 0, '', '', '', '', 1, '2025-12-13 20:44:17'),
(129, 1, '298374615', 'משה', 'הגמור', 'אוניברסיטת חיפה', 1, '2025-12-13 20:44:17'),
(130, 0, '', '', '', '', 1, '2025-12-13 20:49:26'),
(131, 1, '298374615', 'משה', 'מושוני', 'אוניברסיטת חיפה', 1, '2025-12-13 20:49:26'),
(132, 0, '', '', '', '', 1, '2025-12-13 20:50:01'),
(133, 1, '298374615', 'משה', 'מושוני', 'אוניברסיטת חיפה', 1, '2025-12-13 20:50:01'),
(134, 1, '298374615', 'משה', 'מושוני', 'אוניברסיטת חיפה', 1, '2025-12-13 20:50:02'),
(135, 0, '', '', '', '', 1, '2025-12-13 20:50:07'),
(136, 1, '298374615', 'משה', 'מושוני', 'אוניברסיטת חיפה', 1, '2025-12-13 20:50:07'),
(137, 0, '', '', '', '', 1, '2025-12-13 20:50:24'),
(138, 1, '298374615', 'משה', 'מושוני', 'אוניברסיטת חיפה', 1, '2025-12-13 20:50:24'),
(139, 0, '', '', '', '', 1, '2025-12-13 21:04:53'),
(140, 1, '298374615', 'משה', 'מושוני', 'אוניברסיטת חיפה', 1, '2025-12-13 21:04:53'),
(141, 0, '', '', '', '', 1, '2025-12-13 22:23:33'),
(142, 1, '298374615', 'משה', 'מושוני', 'אוניברסיטת חיפה', 1, '2025-12-13 22:23:33'),
(143, 0, '', '', '', '', 1, '2025-12-15 10:48:07'),
(144, 1, '298374615', 'משה', 'שונית', 'אוניברסיטת חיפה', 1, '2025-12-15 10:48:07'),
(345, 26, '200032787', 'דניאל', 'פרץ', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:52'),
(346, 26, '300320983', 'דניאל', 'מזרחי', 'אוניברסיטת בר-אילן', 0, '2025-12-16 21:12:52'),
(347, 26, '200182897', 'דניאל', 'נבון', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:53'),
(348, 26, '200886968', 'אדל', 'רבינוביץ', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:53'),
(349, 26, '200773976', 'איתן', 'מלכה', 'מכללת אורנים', 0, '2025-12-16 21:12:53'),
(350, 26, '300041654', 'אריאל', 'כץ', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:53'),
(351, 26, '200122802', 'אופיר', 'זוהר', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:53'),
(352, 26, '200304954', 'איתמר', 'אברהם', 'האקדמיה ללשון העברית', 0, '2025-12-16 21:12:53'),
(353, 26, '200735637', 'גיא', 'אלון', 'האקדמיה ללשון העברית', 0, '2025-12-16 21:12:53'),
(354, 26, '200938504', 'נעם', 'פרץ', 'אוניברסיטת תל אביב', 0, '2025-12-16 21:12:53'),
(355, 26, '300288933', 'תמר', 'גולדברג', 'אוניברסיטת בר-אילן', 0, '2025-12-16 21:12:53'),
(356, 26, '300772365', 'איתמר', 'פישר', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:53'),
(357, 26, '300008513', 'אלון', 'עמר', 'מכון ויצמן למדע', 0, '2025-12-16 21:12:53'),
(358, 26, '200915064', 'רון', 'אלון', 'הטכניון – מכון טכנולוגי לישראל', 0, '2025-12-16 21:12:53'),
(359, 26, '300445970', 'אדל', 'אשכנזי', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:53'),
(360, 26, '300203791', 'דניאל', 'מור', 'מכללת ספיר', 0, '2025-12-16 21:12:53'),
(361, 26, '200441186', 'איתמר', 'פרץ', 'מכללת ספיר', 0, '2025-12-16 21:12:53'),
(362, 26, '200121564', 'אורי', 'דוידי', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:54'),
(363, 26, '300126760', 'אייל', 'זוהר', 'מכון ויצמן למדע', 0, '2025-12-16 21:12:54'),
(364, 26, '300450822', 'אופיר', 'קציר', 'האקדמיה ללשון העברית', 0, '2025-12-16 21:12:54'),
(365, 26, '300056959', 'תמר', 'שרון', 'האקדמיה ללשון העברית', 0, '2025-12-16 21:12:54'),
(366, 26, '300702842', 'אורי', 'טל', 'אוניברסיטת חיפה', 0, '2025-12-16 21:12:54'),
(367, 26, '200496156', 'נעם', 'דנינו', 'האקדמיה ללשון העברית', 0, '2025-12-16 21:12:54'),
(368, 26, '200723575', 'שקד', 'רבינוביץ', 'הטכניון – מכון טכנולוגי לישראל', 0, '2025-12-16 21:12:54'),
(369, 26, '300823978', 'אלון', 'דנינו', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:54'),
(370, 26, '300756749', 'תמר', 'דגן', 'מכללת ספיר', 0, '2025-12-16 21:12:54'),
(371, 26, '200923498', 'תמר', 'בר', 'האוניברסיטה העברית בירושלים', 0, '2025-12-16 21:12:54'),
(372, 26, '200060069', 'תמר', 'דגן', 'מכון ויצמן למדע', 0, '2025-12-16 21:12:54'),
(373, 26, '200379303', 'רפאל', 'שפירא', 'הטכניון – מכון טכנולוגי לישראל', 0, '2025-12-16 21:12:54'),
(374, 26, '200305126', 'תמר', 'נבון', 'אוניברסיטת תל אביב', 0, '2025-12-16 21:12:54'),
(375, 26, '200498236', 'מיכל', 'ביטון', 'מכללת אורנים', 0, '2025-12-16 21:12:54'),
(376, 26, '300594298', 'דניאל', 'פישר', 'האקדמיה ללשון העברית', 0, '2025-12-16 21:12:54'),
(377, 26, '300213196', 'מאיה', 'גרין', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:55'),
(378, 26, '300465663', 'קרן', 'שטרן', 'האוניברסיטה העברית בירושלים', 0, '2025-12-16 21:12:55'),
(379, 26, '200878411', 'מירב', 'דוידי', 'האקדמיה ללשון העברית', 0, '2025-12-16 21:12:55'),
(380, 26, '300919883', 'קרן', 'גרין', 'מכללת ספיר', 0, '2025-12-16 21:12:55'),
(381, 26, '200798403', 'שחר', 'גבאי', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:55'),
(382, 26, '200700102', 'שחר', 'פישר', 'אוניברסיטת חיפה', 0, '2025-12-16 21:12:55'),
(383, 26, '200214179', 'סיון', 'מלכה', 'אוניברסיטת חיפה', 0, '2025-12-16 21:12:55'),
(384, 26, '300497351', 'נעם', 'בר', 'אוניברסיטת תל אביב', 0, '2025-12-16 21:12:55'),
(385, 26, '300838869', 'אורי', 'אשכנזי', 'מכללת אורנים', 0, '2025-12-16 21:12:55'),
(386, 26, '200897338', 'אריאל', 'אברהם', 'אוניברסיטת תל אביב', 0, '2025-12-16 21:12:55'),
(387, 26, '300073319', 'איתן', 'קציר', 'מכללת ספיר', 0, '2025-12-16 21:12:55'),
(388, 26, '200042075', 'עמרי', 'מלכה', 'אוניברסיטת בר-אילן', 0, '2025-12-16 21:12:55'),
(389, 26, '300525813', 'דניאל', 'פישר', 'אוניברסיטת בר-אילן', 0, '2025-12-16 21:12:55'),
(390, 26, '300086758', 'אביגיל', 'שרון', 'מכון ויצמן למדע', 0, '2025-12-16 21:12:55'),
(391, 26, '200743417', 'איתן', 'אלקיים', 'מכללת אורנים', 0, '2025-12-16 21:12:55'),
(392, 26, '300278694', 'נטע', 'כהן', 'מכללת ספיר', 0, '2025-12-16 21:12:56'),
(393, 26, '300518560', 'יואב', 'אברהם', 'הטכניון – מכון טכנולוגי לישראל', 0, '2025-12-16 21:12:56'),
(394, 26, '300187267', 'עמרי', 'חדד', 'אוניברסיטת תל אביב', 0, '2025-12-16 21:12:56'),
(395, 26, '300183019', 'שקד', 'בן־דוד', 'אוניברסיטת חיפה', 0, '2025-12-16 21:12:56'),
(396, 26, '200976470', 'אביגיל', 'שטרן', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:56'),
(397, 26, '300979127', 'ליה', 'קציר', 'אוניברסיטת חיפה', 0, '2025-12-16 21:12:56'),
(398, 26, '300764842', 'רפאל', 'רבינוביץ', 'אוניברסיטת חיפה', 0, '2025-12-16 21:12:56'),
(399, 26, '300474475', 'תמר', 'דוידי', 'האקדמיה ללשון העברית', 0, '2025-12-16 21:12:56'),
(400, 26, '200181311', 'אדל', 'מזרחי', 'האוניברסיטה העברית בירושלים', 0, '2025-12-16 21:12:56'),
(401, 26, '300119153', 'ליה', 'מלכה', 'אוניברסיטת חיפה', 0, '2025-12-16 21:12:56'),
(402, 26, '200143717', 'אייל', 'מור', 'מכללת ספיר', 0, '2025-12-16 21:12:56'),
(403, 26, '200822401', 'דנה', 'ברק', 'האוניברסיטה העברית בירושלים', 0, '2025-12-16 21:12:56'),
(404, 26, '200891927', 'מאיה', 'ביטון', 'הטכניון – מכון טכנולוגי לישראל', 0, '2025-12-16 21:12:56'),
(405, 26, '300781721', 'איתן', 'מזרחי', 'אוניברסיטת בר-אילן', 0, '2025-12-16 21:12:56'),
(406, 26, '200504322', 'קרן', 'ברק', 'הטכניון – מכון טכנולוגי לישראל', 0, '2025-12-16 21:12:56'),
(407, 26, '300781044', 'דנה', 'מלכה', 'האוניברסיטה העברית בירושלים', 0, '2025-12-16 21:12:57'),
(408, 26, '300693520', 'יואב', 'עוז', 'האוניברסיטה העברית בירושלים', 0, '2025-12-16 21:12:57'),
(409, 26, '300725124', 'גיא', 'קציר', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:57'),
(410, 26, '200891661', 'איתמר', 'חזן', 'מכללת ספיר', 0, '2025-12-16 21:12:57'),
(411, 26, '200893535', 'יובל', 'נוימן', 'הטכניון – מכון טכנולוגי לישראל', 0, '2025-12-16 21:12:57'),
(412, 26, '300840121', 'רוני', 'שרון', 'הטכניון – מכון טכנולוגי לישראל', 0, '2025-12-16 21:12:57'),
(413, 26, '300146214', 'יובל', 'לוי', 'הטכניון – מכון טכנולוגי לישראל', 0, '2025-12-16 21:12:57'),
(414, 26, '300569852', 'ליה', 'זוהר', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:57'),
(415, 26, '200594703', 'אדל', 'שרון', 'אוניברסיטת תל אביב', 0, '2025-12-16 21:12:57'),
(416, 26, '200946465', 'ניר', 'מזרחי', 'מכון ויצמן למדע', 0, '2025-12-16 21:12:57'),
(417, 26, '300656121', 'ליאור', 'שלום', 'מכון ויצמן למדע', 0, '2025-12-16 21:12:57'),
(418, 26, '200665420', 'גיא', 'אלקיים', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:57'),
(419, 26, '200819597', 'ליאור', 'לוי', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:57'),
(420, 26, '300837481', 'סיון', 'אדרי', 'אוניברסיטת חיפה', 0, '2025-12-16 21:12:57'),
(421, 26, '200200327', 'דניאל', 'סויסה', 'אוניברסיטת בר-אילן', 0, '2025-12-16 21:12:57'),
(422, 26, '300999430', 'רפאל', 'גולדברג', 'מכללת ספיר', 0, '2025-12-16 21:12:58'),
(423, 26, '200706976', 'ליה', 'לוי', 'אוניברסיטת תל אביב', 0, '2025-12-16 21:12:58'),
(424, 26, '200785046', 'עמרי', 'רוזן', 'מכללת אורנים', 0, '2025-12-16 21:12:58'),
(425, 26, '300640422', 'עמרי', 'מזרחי', 'אוניברסיטת תל אביב', 0, '2025-12-16 21:12:58'),
(426, 26, '200146629', 'דוד', 'אלון', 'אוניברסיטת בר-אילן', 0, '2025-12-16 21:12:58'),
(427, 26, '300403060', 'שחר', 'אלון', 'מכללת אורנים', 0, '2025-12-16 21:12:58'),
(428, 26, '200075927', 'רפאל', 'חדד', 'האקדמיה ללשון העברית', 0, '2025-12-16 21:12:58'),
(429, 26, '200743649', 'אריאל', 'שלום', 'אוניברסיטת חיפה', 0, '2025-12-16 21:12:58'),
(430, 26, '200112266', 'יונתן', 'אלון', 'האוניברסיטה העברית בירושלים', 0, '2025-12-16 21:12:58'),
(431, 26, '300090719', 'נטע', 'עמר', 'אוניברסיטת בן-גוריון בנגב', 0, '2025-12-16 21:12:58'),
(432, 26, '200168284', 'אור', 'אלון', 'אוניברסיטת תל אביב', 0, '2025-12-16 21:12:58'),
(433, 26, '300720638', 'ליה', 'נוימן', 'אוניברסיטת בר-אילן', 0, '2025-12-16 21:12:58'),
(434, 26, '200347417', 'מאיה', 'אלקיים', 'מכללת ספיר', 0, '2025-12-16 21:12:58'),
(435, 26, '300277605', 'יואב', 'זוהר', 'אוניברסיטת בר-אילן', 0, '2025-12-16 21:12:58'),
(436, 26, '200934479', 'סיון', 'דנינו', 'מכללת ספיר', 0, '2025-12-16 21:12:58'),
(437, 26, '300522968', 'רון', 'שלום', 'האקדמיה ללשון העברית', 0, '2025-12-16 21:12:59'),
(438, 26, '300574225', 'ניר', 'רוזן', 'מכללת אורנים', 0, '2025-12-16 21:12:59'),
(439, 26, '300158607', 'אריאל', 'אלקיים', 'האקדמיה ללשון העברית', 0, '2025-12-16 21:12:59'),
(440, 26, '200294510', 'שקד', 'כהן', 'אוניברסיטת חיפה', 0, '2025-12-16 21:12:59'),
(441, 26, '200443133', 'אביגיל', 'קציר', 'האקדמיה ללשון העברית', 0, '2025-12-16 21:12:59'),
(442, 26, '200771103', 'קרן', 'שטרן', 'אוניברסיטת בר-אילן', 0, '2025-12-16 21:12:59'),
(443, 26, '200771285', 'נעם', 'מור', 'מכון ויצמן למדע', 0, '2025-12-16 21:12:59'),
(444, 26, '200009421', 'הילה', 'נבון', 'מכון ויצמן למדע', 0, '2025-12-16 21:12:59'),
(445, 55, '298374615', 'יואב', 'אליאסי', 'אוניברסיטת חיפה', 1, '2025-12-17 21:18:06'),
(446, 55, '298374615', 'יואב', 'אליאסי', 'אוניברסיטת חיפה', 1, '2025-12-17 21:26:31'),
(447, 55, '200454551', 'fghdfgh', 'dfghdfghdfg', 'dfgdfg', 1, '2025-12-17 21:42:00'),
(454, 55, '222222222', 'כככככככככככ', 'גגגגגגגגגגגג', 'גגגגגגגגג', 1, '2025-12-17 21:49:47'),
(456, 55, 'ggggggggg', 'ggggggggggggggggg', 'ggggggggggggggggggggg', 'gggggggggggggggggggg', 1, '2025-12-17 21:52:39');

-- --------------------------------------------------------

--
-- Table structure for table `events`
--

CREATE TABLE `events` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `institute` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `events`
--

INSERT INTO `events` (`id`, `name`, `title`, `institute`, `created_at`) VALUES
(1, 'dec_geo', 'יום עיון מחלקת גיאוגרפיה', 'האוניברסיטה העברית', '2025-12-10 20:33:18'),
(3, 'tau_open_day', 'ברוכים הבאים ליום פתוח של אוניברסיטת תל אביב', 'אוניברסיטת תל אביב', '2025-12-10 21:00:45'),
(5, 'ariel_uni', 'יום עיון מדעי הרוח', 'אוניברסיטת אריאל', '2025-12-10 21:11:05'),
(29, 'יום עיון מחלקת ארכיאולוגיה', 'יום עיון מחלקת ארכיאולוגיה', 'האוניברסיטה העברית', '2025-12-17 07:55:34'),
(57, 'ככככככככככככככככ', 'גגגגגגגגגגגגגגגגגגג', 'עעעעעעעעעעעע', '2025-12-18 21:33:10'),
(58, 'עעעעעעעעעעעעעעעע', 'עכככככככככככככככככ', 'עיכעיכעיכעעעעעעעעע', '2025-12-18 21:34:27');

-- --------------------------------------------------------

--
-- Table structure for table `roles`
--

CREATE TABLE `roles` (
  `id` int(255) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `roles`
--

INSERT INTO `roles` (`id`, `name`) VALUES
(1, 'user'),
(2, 'admin'),
(3, 'super admin');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(255) NOT NULL,
  `user_name` varchar(255) NOT NULL,
  `user_password` varchar(255) NOT NULL,
  `user_email` varchar(255) NOT NULL,
  `role` int(11) NOT NULL,
  `institute_id` int(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `user_name`, `user_password`, `user_email`, `role`, `institute_id`) VALUES
(1, 'ינון בר', '053508384', 'yinonbar1988@gmail.com', 3, 6500),
(3, 'ינון', '0505713460', 'yinonbar1988@gmail.com', 2, 5500),
(8, 'יצחק וייס', '$2y$10$wwi4dK0JityMJ0y4YfXorulOjT5uzuRHzYDOPf5N0LgstcD.0xuVe', 'test@example.com', 2, 6500);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `attendees`
--
ALTER TABLE `attendees`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `events`
--
ALTER TABLE `events`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD KEY `role` (`role`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `attendees`
--
ALTER TABLE `attendees`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=458;

--
-- AUTO_INCREMENT for table `events`
--
ALTER TABLE `events`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=59;

--
-- AUTO_INCREMENT for table `roles`
--
ALTER TABLE `roles`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `users`
--
ALTER TABLE `users`
  ADD CONSTRAINT `role` FOREIGN KEY (`role`) REFERENCES `roles` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
