-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 07, 2025 at 03:59 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `10dance`
--
CREATE DATABASE IF NOT EXISTS `10dance` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
USE `10dance`;

-- --------------------------------------------------------

--
-- Table structure for table `dec_geo`
--

CREATE TABLE `dec_geo` (
  `id` int(11) NOT NULL,
  `tz_id` varchar(9) NOT NULL,
  `fName` varchar(50) NOT NULL,
  `lName` varchar(50) NOT NULL,
  `institute` varchar(100) NOT NULL,
  `isArrived` int(11) NOT NULL,
  `event_id` int(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `dec_geo`
--

INSERT INTO `dec_geo` (`id`, `tz_id`, `fName`, `lName`, `institute`, `isArrived`, `event_id`) VALUES
(1, '300654897', 'אביעד', 'שושנה', 'אוניברסיטת יוטה', 1, 2),
(2, '200789123', 'יעל', 'פרנקל', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 2),
(3, '300987456', 'מיכל', 'מלמד', 'אוניברסיטת קרולינה הדרומית', 1, 2),
(4, '300654897', 'אביעד', 'שושנה', 'אוניברסיטת יוטה', 1, 2),
(5, '200789123', 'יעל', 'פרנקל', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 2),
(6, '300987456', 'מיכל', 'מלמד', 'אוניברסיטת קרולינה הדרומית', 1, 2),
(7, '200234567', 'משה', 'שוורץ', 'אוניברסיטת טקסס הצפונית', 1, 2),
(8, '300876543', 'דבורה', 'כהן', 'אוניברסיטת פנסילבניה', 0, 2),
(9, '200789654', 'יהונתן', 'פרידמן', 'אוניברסיטת פלורידה', 1, 2),
(10, '300345678', 'נועה', 'גולדברג', 'אוניברסיטת קליפורניה לוס אנג\'לס', 0, 2),
(11, '200876543', 'אביגיל', 'זלצר', 'אוניברסיטת מרילנד', 1, 2),
(12, '300987321', 'טל', 'וינשטיין', 'אוניברסיטת וירג\'יניה', 0, 2),
(13, '200789654', 'נועה', 'שוורץ', 'אוניברסיטת קרולינה הצפונית', 1, 2),
(14, '300567891', 'שלומי', 'שטרית', 'אוניברסיטת קליפורניה סאן דייגו', 0, 2),
(15, '200234678', 'מאיה', 'רוזנטל', 'אוניברסיטת ג\'ורג\'יה', 1, 2),
(16, '300876912', 'נועה', 'אלפסי', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 2),
(17, '200345789', 'אורי', 'קציר', 'אוניברסיטת איוה', 1, 2),
(18, '300654897', 'אביגיל', 'כהן', 'אוניברסיטת קליפורניה אירווין', 0, 2),
(19, '200789123', 'דניאל', 'שמשון', 'אוניברסיטת אריזונה', 1, 2),
(20, '300987456', 'אביגיל', 'גבע', 'אוניברסיטת קולורדו בולדר', 0, 2),
(21, '200234567', 'רונן', 'מלכה', 'אוניברסיטת וירג\'יניה', 1, 2),
(22, '300876543', 'ספיר', 'רוזנבלט', 'אוניברסיטת קליפורניה דייויס', 0, 2),
(23, '200789654', 'אריה', 'כהן', 'אוניברסיטת אלבמה', 1, 2),
(24, '300567890', 'שרה', 'לוי', 'אוניברסיטת קליפורניה סנטה קרוז', 0, 2),
(25, '200345678', 'עידו', 'גולדשטיין', 'אוניברסיטת ויסקונסין-מדיסון', 1, 2),
(26, '300654897', 'טליה', 'אברמוביץ', 'אוניברסיטת קליפורניה ריברסייד', 0, 2),
(27, '200789123', 'דנה', 'כהנא', 'אוניברסיטת קנטוקי', 1, 2),
(28, '300987456', 'שי', 'אדלר', 'אוניברסיטת קליפורניה סן פרנסיסקו', 0, 2),
(29, '200234567', 'שוש', 'רוזנברג', 'אוניברסיטת קונטיקט', 1, 2),
(30, '300876543', 'אברהם', 'לוי', 'אוניברסיטת טקסס', 0, 2),
(31, '200789654', 'אמיר', 'גרוסמן', 'אוניברסיטת פיטסבורג', 1, 2),
(32, '300567890', 'נועה', 'אדלר', 'אוניברסיטת מילווקי', 0, 2),
(33, '200345678', 'אביתר', 'שושנה', 'אוניברסיטת יוטה', 1, 2),
(34, '300654897', 'אביב', 'פרנקל', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 2),
(35, '200789123', 'אמילי', 'מלמד', 'אוניברסיטת קרולינה הדרומית', 1, 2),
(36, '300987456', 'שחר', 'לוי', 'אוניברסיטת קולורדו דנוור', 0, 2),
(37, '200234567', 'דור', 'שוורץ', 'אוניברסיטת איילנד', 1, 2),
(38, '300876543', 'מיכל', 'שטיין', 'אוניברסיטת צינסינטי', 0, 2),
(39, '200789654', 'איתן', 'פרלמן', 'אוניברסיטת דלאוור', 1, 2),
(40, '300567890', 'ליאון', 'כהן', 'אוניברסיטת נברסקה', 0, 2),
(41, '200345678', 'עומר', 'אברמוביץ', 'אוניברסיטת ניו מקסיקו', 1, 2),
(42, '300654897', 'דניאל', 'שרון', 'אוניברסיטת נבדה', 0, 2),
(43, '200789123', 'מאיה', 'פרידמן', 'אוניברסיטת ניו המפשייר', 1, 2),
(44, '300987456', 'אלון', 'כהן', 'אוניברסיטת דקוטה הצפונית', 0, 2),
(45, '200234567', 'מור', 'ברזילי', 'אוניברסיטת איוה', 1, 2),
(46, '300876543', 'יפית', 'רוזנבלט', 'אוניברסיטת קליפורניה דייויס', 0, 2),
(47, '200789654', 'יהושע', 'כהן', 'אוניברסיטת אלבמה', 1, 2),
(48, '300567890', 'שרית', 'לוי', 'אוניברסיטת קליפורניה סנטה קרוז', 0, 2),
(49, '200345678', 'גל', 'גולדשטיין', 'אוניברסיטת ויסקונסין-מדיסון', 1, 2),
(50, '300654897', 'דן', 'אברמוביץ', 'אוניברסיטת קליפורניה ריברסייד', 0, 2),
(51, '200789123', 'יעל', 'כהנא', 'אוניברסיטת קנטוקי', 1, 2),
(52, '300987456', 'נור', 'אדלר', 'אוניברסיטת קליפורניה סן פרנסיסקו', 0, 2),
(53, '200234567', 'טום', 'רוזנברג', 'אוניברסיטת קונטיקט', 1, 2),
(54, '300876543', 'נורית', 'לוי', 'אוניברסיטת טקסס', 0, 2),
(55, '200789654', 'אריה', 'גרוסמן', 'אוניברסיטת פיטסבורג', 1, 2),
(56, '300567890', 'אייל', 'אדלר', 'אוניברסיטת מילווקי', 0, 2),
(57, '200345678', 'טלי', 'שושנה', 'אוניברסיטת יוטה', 1, 2),
(58, '300654897', 'ניר', 'פרנקל', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 2),
(59, '200789123', 'ליה', 'מלמד', 'אוניברסיטת קרולינה הדרומית', 1, 2),
(60, '300987456', 'כרם', 'לוי', 'אוניברסיטת קולורדו דנוור', 0, 2),
(61, '200234567', 'נועה', 'שוורץ', 'אוניברסיטת איילנד', 1, 2),
(62, '300876543', 'אבי', 'שטיין', 'אוניברסיטת צינסינטי', 0, 2),
(63, '200789654', 'שי', 'פרלמן', 'אוניברסיטת דלאוור', 1, 2),
(64, '300567890', 'יהודית', 'כהן', 'אוניברסיטת נברסקה', 0, 2),
(65, '200345678', 'רועי', 'אברמוביץ', 'אוניברסיטת ניו מקסיקו', 1, 2),
(66, '300654897', 'נועה', 'שרון', 'אוניברסיטת נבדה', 0, 2),
(67, '200789123', 'מורן', 'פרידמן', 'אוניברסיטת ניו המפשייר', 1, 2),
(68, '300987456', 'רון', 'כהן', 'אוניברסיטת דקוטה הצפונית', 0, 2),
(69, '200234567', 'נועה', 'ברזילי', 'אוניברסיטת איוה', 1, 2),
(70, '300876543', 'דנה', 'רוזנבלט', 'אוניברסיטת קליפורניה דייויס', 0, 2),
(71, '200789654', 'יעקב', 'כהן', 'אוניברסיטת אלבמה', 1, 2),
(72, '300567890', 'נועה', 'לוי', 'אוניברסיטת קליפורניה סנטה קרוז', 0, 2),
(73, '200345678', 'עדי', 'גולדשטיין', 'אוניברסיטת ויסקונסין-מדיסון', 1, 2),
(74, '300654897', 'ניסן', 'אברמוביץ', 'אוניברסיטת קליפורניה ריברסייד', 0, 2),
(75, '200789123', 'נוגה', 'כהנא', 'אוניברסיטת קנטוקי', 1, 2),
(76, '300987456', 'יעל', 'אדלר', 'אוניברסיטת קליפורניה סן פרנסיסקו', 0, 2),
(77, '200234567', 'מאור', 'רוזנברג', 'אוניברסיטת קונטיקט', 1, 2),
(78, '300876543', 'מאור', 'לוי', 'אוניברסיטת טקסס', 0, 2),
(79, '200789654', 'אביה', 'גרוסמן', 'אוניברסיטת פיטסבורג', 1, 2),
(80, '300567890', 'כרמל', 'אדלר', 'אוניברסיטת מילווקי', 0, 2),
(81, '200345678', 'אפרים', 'שושנה', 'אוניברסיטת יוטה', 1, 2),
(82, '300654897', 'אילה', 'פרנקל', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 2),
(83, '200789123', 'אורי', 'מלמד', 'אוניברסיטת קרולינה הדרומית', 1, 2),
(84, '300987456', 'מתן', 'לוי', 'אוניברסיטת קולורדו דנוור', 0, 2),
(85, '200234567', 'איל', 'שוורץ', 'אוניברסיטת איילנד', 1, 2),
(86, '300876543', 'דורון', 'שטיין', 'אוניברסיטת צינסינטי', 0, 2),
(87, '200789654', 'איל', 'פרלמן', 'אוניברסיטת דלאוור', 1, 2),
(88, '300567890', 'ליה', 'כהן', 'אוניברסיטת נברסקה', 0, 2),
(89, '200345678', 'אלעד', 'אברמוביץ', 'אוניברסיטת ניו מקסיקו', 1, 2),
(90, '300654897', 'אריה', 'שרון', 'אוניברסיטת נבדה', 0, 2),
(91, '200789123', 'דנה', 'פרידמן', 'אוניברסיטת ניו המפשייר', 1, 2),
(92, '300987456', 'אביתר', 'כהן', 'אוניברסיטת דקוטה הצפונית', 0, 2),
(93, '200234567', 'מיכאל', 'ברזילי', 'אוניברסיטת איוה', 1, 2),
(94, '300876543', 'מאיה', 'רוזנבלט', 'אוניברסיטת קליפורניה דייויס', 0, 2),
(95, '200789654', 'נועה', 'כהן', 'אוניברסיטת אלבמה', 1, 2),
(96, '300567890', 'יהושע', 'לוי', 'אוניברסיטת קליפורניה סנטה קרוז', 0, 2),
(97, '200345678', 'דוד', 'גולדשטיין', 'אוניברסיטת ויסקונסין-מדיסון', 1, 2),
(98, '300654897', 'מאיה', 'אברמוביץ', 'אוניברסיטת קליפורניה ריברסייד', 0, 2),
(99, '200789123', 'דור', 'כהנא', 'אוניברסיטת קנטוקי', 1, 2),
(100, '300987456', 'מאור', 'אדלר', 'אוניברסיטת קליפורניה סן פרנסיסקו', 0, 2),
(101, '200234567', 'שרה', 'רוזנברג', 'אוניברסיטת קונטיקט', 1, 2),
(102, '300876543', 'עמית', 'לוי', 'אוניברסיטת טקסס', 0, 2),
(103, '200789654', 'יהודה', 'גרוסמן', 'אוניברסיטת פיטסבורג', 1, 2),
(104, '300567890', 'דניאל', 'אדלר', 'אוניברסיטת מילווקי', 0, 2),
(105, '200345678', 'עומר', 'שושנה', 'אוניברסיטת יוטה', 1, 2),
(106, '300654897', 'יהונתן', 'פרנקל', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 2),
(107, '200789123', 'אדל', 'מלמד', 'אוניברסיטת קרולינה הדרומית', 1, 2),
(108, '300987456', 'דניאל', 'לוי', 'אוניברסיטת קולורדו דנוור', 0, 2),
(109, '200234567', 'דור', 'שוורץ', 'אוניברסיטת איילנד', 1, 2),
(110, '300876543', 'נור', 'שטיין', 'אוניברסיטת צינסינטי', 0, 2),
(111, '200789654', 'דור', 'פרלמן', 'אוניברסיטת דלאוור', 1, 2),
(112, '300567890', 'אמיר', 'כהן', 'אוניברסיטת נברסקה', 0, 2),
(113, '200345678', 'אדל', 'אברמוביץ', 'אוניברסיטת ניו מקסיקו', 1, 2),
(114, '300654897', 'טלי', 'שרון', 'אוניברסיטת נבדה', 0, 2),
(115, '200789123', 'סתיו', 'פרידמן', 'אוניברסיטת ניו המפשייר', 1, 2),
(116, '300987456', 'אורי', 'כהן', 'אוניברסיטת דקוטה הצפונית', 0, 2),
(117, '200234567', 'רומי', 'ברזילי', 'אוניברסיטת איוה', 1, 2),
(118, '300876543', 'מאור', 'רוזנבלט', 'אוניברסיטת קליפורניה דייויס', 0, 2),
(119, '200789654', 'יהונתן', 'כהן', 'אוניברסיטת אלבמה', 1, 2),
(120, '300567890', 'יהודית', 'לוי', 'אוניברסיטת קליפורניה סנטה קרוז', 0, 2),
(121, '200345678', 'רותם', 'גולדשטיין', 'אוניברסיטת ויסקונסין-מדיסון', 1, 2),
(122, '300654897', 'נוגה', 'אברמוביץ', 'אוניברסיטת קליפורניה ריברסייד', 0, 2),
(123, '200789123', 'שמשון', 'כהנא', 'אוניברסיטת קנטוקי', 1, 2),
(124, '300987456', 'רון', 'אדלר', 'אוניברסיטת קליפורניה סן פרנסיסקו', 0, 2),
(125, '200234567', 'עמית', 'רוזנברג', 'אוניברסיטת קונטיקט', 1, 2),
(126, '300876543', 'דנה', 'לוי', 'אוניברסיטת טקסס', 0, 2),
(127, '200789654', 'אלעד', 'גרוסמן', 'אוניברסיטת פיטסבורג', 1, 2),
(128, '300567890', 'דניאל', 'אדלר', 'אוניברסיטת מילווקי', 0, 2),
(129, '200345678', 'אלה', 'שושנה', 'אוניברסיטת יוטה', 1, 2),
(130, '300654897', 'מתן', 'פרנקל', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 2),
(131, '200789123', 'יהונתן', 'מלמד', 'אוניברסיטת קרולינה הדרומית', 1, 2),
(132, '300987456', 'דניאל', 'לוי', 'אוניברסיטת קולורדו דנוור', 0, 2),
(133, '200234567', 'מיכל', 'שוורץ', 'אוניברסיטת איילנד', 1, 2),
(134, '300876543', 'אלעד', 'שטיין', 'אוניברסיטת צינסינטי', 0, 2),
(135, '200789654', 'יהונתן', 'פרלמן', 'אוניברסיטת דלאוור', 1, 2),
(136, '300567890', 'אמיר', 'כהן', 'אוניברסיטת נברסקה', 0, 2),
(137, '200345678', 'דנה', 'אברמוביץ', 'אוניברסיטת ניו מקסיקו', 1, 2),
(138, '300654897', 'איתן', 'שרון', 'אוניברסיטת נבדה', 0, 2),
(139, '200789123', 'יהושע', 'פרידמן', 'אוניברסיטת ניו המפשייר', 1, 2),
(140, '300987456', 'רותם', 'כהן', 'אוניברסיטת דקוטה הצפונית', 0, 2),
(141, '200234567', 'דנה', 'ברזילי', 'אוניברסיטת איוה', 1, 2),
(142, '300876543', 'רון', 'רוזנבלט', 'אוניברסיטת קליפורניה דייויס', 0, 2),
(143, '200789654', 'דניאל', 'כהן', 'אוניברסיטת אלבמה', 1, 2),
(144, '300567890', 'דוד', 'לוי', 'אוניברסיטת קליפורניה סנטה קרוז', 0, 2),
(145, '200345678', 'אביתר', 'גולדשטיין', 'אוניברסיטת ויסקונסין-מדיסון', 1, 2),
(146, '300654897', 'מאיה', 'אברמוביץ', 'אוניברסיטת קליפורניה ריברסייד', 0, 2),
(147, '200789123', 'יעל', 'כהנא', 'אוניברסיטת קנטוקי', 1, 2),
(148, '300987456', 'נור', 'אדלר', 'אוניברסיטת קליפורניה סן פרנסיסקו', 0, 2),
(149, '200234567', 'טל', 'רוזנברג', 'אוניברסיטת קונטיקט', 1, 2),
(150, '300876543', 'נורית', 'לוי', 'אוניברסיטת טקסס', 0, 2),
(151, '200789654', 'אריה', 'גרוסמן', 'אוניברסיטת פיטסבורג', 1, 2),
(152, '300567890', 'שרה', 'אדלר', 'אוניברסיטת מילווקי', 0, 2),
(153, '200345678', 'עידן', 'שושנה', 'אוניברסיטת יוטה', 1, 2),
(154, '300654897', 'אביב', 'פרנקל', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 2),
(155, '200789123', 'מאיר', 'מלמד', 'אוניברסיטת קרולינה הדרומית', 1, 2),
(156, '300987456', 'מיה', 'לוי', 'אוניברסיטת קולורדו דנוור', 0, 2),
(157, '200234567', 'רוני', 'שוורץ', 'אוניברסיטת איילנד', 1, 2),
(158, '300876543', 'טלי', 'שטיין', 'אוניברסיטת צינסינטי', 0, 2),
(159, '200789654', 'אריה', 'פרלמן', 'אוניברסיטת דלאוור', 1, 2),
(160, '300567890', 'איתן', 'כהן', 'אוניברסיטת נברסקה', 0, 2),
(161, '200345678', 'טל', 'אברמוביץ', 'אוניברסיטת ניו מקסיקו', 1, 2),
(162, '300654897', 'עמית', 'שרון', 'אוניברסיטת נבדה', 0, 2),
(163, '200789123', 'יפית', 'פרידמן', 'אוניברסיטת ניו המפשייר', 1, 2),
(164, '300987456', 'דני', 'כהן', 'אוניברסיטת דקוטה הצפונית', 0, 2),
(165, '200234567', 'אדר', 'ברזילי', 'אוניברסיטת איוה', 1, 2),
(166, '300876543', 'אמילי', 'רוזנבלט', 'אוניברסיטת קליפורניה דייויס', 0, 2),
(167, '200789654', 'רות', 'כהן', 'אוניברסיטת אלבמה', 1, 2),
(168, '300567890', 'מיכאל', 'לוי', 'אוניברסיטת קליפורניה סנטה קרוז', 0, 2),
(169, '200345678', 'אדריאל', 'גולדשטיין', 'אוניברסיטת ויסקונסין-מדיסון', 1, 2),
(170, '300654897', 'יהודית', 'אברמוביץ', 'אוניברסיטת קליפורניה ריברסייד', 0, 2),
(171, '200789123', 'טום', 'כהנא', 'אוניברסיטת קנטוקי', 1, 2),
(172, '300987456', 'שחר', 'אדלר', 'אוניברסיטת קליפורניה סן פרנסיסקו', 0, 2),
(173, '200234567', 'אור', 'רוזנברג', 'אוניברסיטת קונטיקט', 1, 2),
(174, '300876543', 'גיא', 'לוי', 'אוניברסיטת טקסס', 0, 2),
(175, '200789654', 'טל', 'גרוסמן', 'אוניברסיטת פיטסבורג', 1, 2),
(176, '300567890', 'מתן', 'אדלר', 'אוניברסיטת מילווקי', 0, 2),
(177, '200345678', 'נור', 'שושנה', 'אוניברסיטת יוטה', 1, 2),
(178, '300654897', 'אורן', 'פרנקל', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 2),
(179, '200789123', 'שחר', 'מלמד', 'אוניברסיטת קרולינה הדרומית', 1, 2),
(180, '300987456', 'מיכל', 'לוי', 'אוניברסיטת קולורדו דנוור', 0, 2),
(181, '200234567', 'שיר', 'שוורץ', 'אוניברסיטת איילנד', 1, 2),
(182, '300876543', 'רונית', 'שטיין', 'אוניברסיטת צינסינטי', 0, 2),
(183, '200789654', 'סהר', 'פרלמן', 'אוניברסיטת דלאוור', 1, 2),
(184, '300567890', 'איתן', 'כהן', 'אוניברסיטת נברסקה', 0, 2),
(185, '200345678', 'שי', 'אברמוביץ', 'אוניברסיטת ניו מקסיקו', 1, 2),
(186, '300654897', 'אביה', 'שרון', 'אוניברסיטת נבדה', 0, 2),
(187, '200789123', 'דנה', 'פרידמן', 'אוניברסיטת ניו המפשייר', 1, 2),
(188, '300987456', 'יהונתן', 'כהן', 'אוניברסיטת דקוטה הצפונית', 0, 2),
(189, '200234567', 'טום', 'ברזילי', 'אוניברסיטת איוה', 1, 2),
(190, '300876543', 'יהודית', 'רוזנבלט', 'אוניברסיטת קליפורניה דייויס', 0, 2),
(191, '200789654', 'מאיר', 'כהן', 'אוניברסיטת אלבמה', 1, 2),
(192, '300567890', 'דוד', 'לוי', 'אוניברסיטת קליפורניה סנטה קרוז', 0, 2),
(193, '200345678', 'איתן', 'גולדשטיין', 'אוניברסיטת ויסקונסין-מדיסון', 1, 2),
(194, '300654897', 'אילה', 'אברמוביץ', 'אוניברסיטת קליפורניה ריברסייד', 0, 2),
(195, '200789123', 'נוגה', 'כהנא', 'אוניברסיטת קנטוקי', 1, 2),
(196, '300987456', 'דן', 'אדלר', 'אוניברסיטת קליפורניה סן פרנסיסקו', 0, 2),
(197, '200234567', 'אורי', 'רוזנברג', 'אוניברסיטת קונטיקט', 1, 2),
(198, '300876543', 'דוד', 'לוי', 'אוניברסיטת טקסס', 0, 2),
(199, '200789654', 'יהונתן', 'גרוסמן', 'אוניברסיטת פיטסבורג', 1, 2),
(200, '300567890', 'רותם', 'אדלר', 'אוניברסיטת מילווקי', 0, 2),
(201, '200345678', 'נור', 'שושנה', 'אוניברסיטת יוטה', 1, 2),
(202, '300654897', 'אורן', 'פרנקל', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 2),
(203, '200789123', 'יפה', 'מלמד', 'אוניברסיטת קרולינה הדרומית', 1, 2),
(204, '300987456', 'מור', 'לוי', 'אוניברסיטת קולורדו דנוור', 0, 2),
(205, '200234567', 'דניאל', 'שוורץ', 'אוניברסיטת איילנד', 1, 2),
(206, '300876543', 'מאיר', 'שטיין', 'אוניברסיטת צינסינטי', 0, 2),
(207, '200789654', 'יפה', 'פרלמן', 'אוניברסיטת דלאוור', 1, 2),
(208, '300567890', 'רוני', 'כהן', 'אוניברסיטת נברסקה', 0, 2),
(209, '200345678', 'אלון', 'אברמוביץ', 'אוניברסיטת ניו מקסיקו', 1, 2),
(210, '300654897', 'אביתר', 'שרון', 'אוניברסיטת נבדה', 0, 2),
(211, '200789123', 'נופר', 'פרידמן', 'אוניברסיטת ניו המפשייר', 1, 2),
(212, '300987456', 'יפית', 'כהן', 'אוניברסיטת דקוטה הצפונית', 0, 2),
(213, '200234567', 'עמוס', 'ברזילי', 'אוניברסיטת איוה', 1, 2),
(214, '300876543', 'מיכל', 'רוזנבלט', 'אוניברסיטת קליפורניה דייויס', 0, 2),
(215, '200789654', 'אלון', 'כהן', 'אוניברסיטת אלבמה', 1, 2),
(216, '300567890', 'אופיר', 'לוי', 'אוניברסיטת קליפורניה סנטה קרוז', 0, 2),
(217, '200345678', 'יהודית', 'גולדשטיין', 'אוניברסיטת ויסקונסין-מדיסון', 1, 2),
(218, '300654897', 'מאיה', 'אברמוביץ', 'אוניברסיטת קליפורניה ריברסייד', 0, 2),
(219, '200789123', 'רועי', 'כהנא', 'אוניברסיטת קנטוקי', 1, 2),
(220, '300987456', 'איתן', 'אדלר', 'אוניברסיטת קליפורניה סן פרנסיסקו', 0, 2),
(221, '200234567', 'אוריה', 'רוזנברג', 'אוניברסיטת קונטיקט', 1, 2),
(222, '300876543', 'אביה', 'לוי', 'אוניברסיטת טקסס', 0, 2),
(223, '200789654', 'שי', 'גרוסמן', 'אוניברסיטת פיטסבורג', 1, 2),
(224, '300567890', 'דני', 'אדלר', 'אוניברסיטת מילווקי', 0, 2),
(225, '200345678', 'אריאל', 'שושנה', 'אוניברסיטת יוטה', 1, 2),
(226, '300654897', 'אביגיל', 'פרנקל', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 2),
(227, '200789123', 'שחף', 'מלמד', 'אוניברסיטת קרולינה הדרומית', 1, 2),
(228, '300987456', 'עידו', 'לוי', 'אוניברסיטת קולורדו דנוור', 0, 2),
(229, '200234567', 'רון', 'שוורץ', 'אוניברסיטת איילנד', 1, 2),
(230, '300876543', 'רוי', 'שטיין', 'אוניברסיטת צינסינטי', 0, 2),
(231, '200789654', 'אביה', 'פרלמן', 'אוניברסיטת דלאוור', 1, 2),
(232, '300567890', 'טל', 'כהן', 'אוניברסיטת נברסקה', 0, 2),
(233, '200345678', 'שרה', 'אברמוביץ', 'אוניברסיטת ניו מקסיקו', 1, 2),
(234, '300654897', 'אריה', 'שרון', 'אוניברסיטת נבדה', 0, 2),
(235, '200789123', 'מאור', 'פרידמן', 'אוניברסיטת ניו המפשייר', 1, 2),
(236, '300987456', 'רותם', 'כהן', 'אוניברסיטת דקוטה הצפונית', 0, 2),
(237, '200234567', 'אורן', 'ברזילי', 'אוניברסיטת איוה', 1, 2),
(238, '300876543', 'יעל', 'רוזנבלט', 'אוניברסיטת קליפורניה דייויס', 0, 2),
(239, '200789654', 'נופר', 'כהן', 'אוניברסיטת אלבמה', 1, 2),
(240, '300567890', 'עמוס', 'לוי', 'אוניברסיטת קליפורניה סנטה קרוז', 0, 2),
(241, '200345678', 'אביגיל', 'גולדשטיין', 'אוניברסיטת ויסקונסין-מדיסון', 1, 2),
(242, '300654897', 'עמית', 'אברמוביץ', 'אוניברסיטת קליפורניה ריברסייד', 0, 2),
(243, '200789123', 'נופר', 'כהנא', 'אוניברסיטת קנטוקי', 1, 2),
(244, '300987456', 'נופר', 'אדלר', 'אוניברסיטת קליפורניה סן פרנסיסקו', 0, 2),
(245, '200234567', 'אור', 'רוזנברג', 'אוניברסיטת קונטיקט', 1, 2),
(246, '300876543', 'יהודית', 'לוי', 'אוניברסיטת טקסס', 0, 2),
(247, '200789654', 'מיכל', 'גרוסמן', 'אוניברסיטת פיטסבורג', 1, 2),
(248, '300567890', 'שרה', 'אדלר', 'אוניברסיטת מילווקי', 0, 2),
(249, '200345678', 'עמית', 'שושנה', 'אוניברסיטת יוטה', 1, 2),
(250, '300654897', 'נור', 'פרנקל', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 2),
(251, '200789123', 'מאיר', 'מלמד', 'אוניברסיטת קרולינה הדרומית', 1, 2),
(252, '300987456', 'מיה', 'לוי', 'אוניברסיטת קולורדו דנוור', 0, 2),
(253, '200234567', 'רוני', 'שוורץ', 'אוניברסיטת איילנד', 1, 2),
(254, '300876543', 'טלי', 'שטיין', 'אוניברסיטת צינסינטי', 0, 2),
(255, '200789654', 'אריה', 'פרלמן', 'אוניברסיטת דלאוור', 1, 2),
(256, '300567890', 'דניאל', 'כהן', 'אוניברסיטת נברסקה', 0, 2),
(257, '200345678', 'אלה', 'שושנה', 'אוניברסיטת יוטה', 1, 2),
(258, '300654897', 'מתן', 'פרנקל', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 2),
(259, '200789123', 'יהונתן', 'מלמד', 'אוניברסיטת קרולינה הדרומית', 1, 2),
(260, '300987456', 'דניאל', 'לוי', 'אוניברסיטת קולורדו דנוור', 0, 2),
(261, '200234567', 'מיכל', 'שוורץ', 'אוניברסיטת איילנד', 1, 2),
(262, '300876543', 'אלעד', 'שטיין', 'אוניברסיטת צינסינטי', 0, 2),
(263, '200789654', 'יהונתן', 'פרלמן', 'אוניברסיטת דלאוור', 1, 2),
(264, '300567890', 'אמיר', 'כהן', 'אוניברסיטת נברסקה', 0, 2),
(265, '200345678', 'דור', 'אברמוביץ', 'אוניברסיטת ניו מקסיקו', 1, 2),
(266, '300654897', 'איתן', 'שרון', 'אוניברסיטת נבדה', 0, 2),
(267, '200789123', 'סתיו', 'פרידמן', 'אוניברסיטת ניו המפשייר', 1, 2),
(268, '300987456', 'אורי', 'כהן', 'אוניברסיטת דקוטה הצפונית', 0, 2),
(269, '200234567', 'רומי', 'ברזילי', 'אוניברסיטת איוה', 1, 2),
(270, '300876543', 'מאור', 'רוזנבלט', 'אוניברסיטת קליפורניה דייויס', 0, 2),
(271, '200789654', 'יהונתן', 'כהן', 'אוניברסיטת אלבמה', 1, 2),
(272, '300567890', 'יהודית', 'לוי', 'אוניברסיטת קליפורניה סנטה קרוז', 0, 2),
(273, '200345678', 'רותם', 'גולדשטיין', 'אוניברסיטת ויסקונסין-מדיסון', 1, 2);

-- --------------------------------------------------------

--
-- Table structure for table `event_mapping`
--

CREATE TABLE `event_mapping` (
  `id` int(255) NOT NULL,
  `event_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `event_mapping`
--

INSERT INTO `event_mapping` (`id`, `event_name`) VALUES
(1, 'יום אוריינטציה לעובדים חדשים'),
(2, 'אירוע גיאוגרפיה');

-- --------------------------------------------------------

--
-- Table structure for table `orientation_day`
--

CREATE TABLE `orientation_day` (
  `id` int(11) NOT NULL,
  `tz_id` char(9) DEFAULT NULL,
  `fName` varchar(255) DEFAULT NULL,
  `lName` varchar(255) DEFAULT NULL,
  `institute` varchar(255) DEFAULT NULL,
  `isArrived` tinyint(1) DEFAULT NULL,
  `event_id` int(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `orientation_day`
--

INSERT INTO `orientation_day` (`id`, `tz_id`, `fName`, `lName`, `institute`, `isArrived`, `event_id`) VALUES
(154, '200765432', 'אלעד', 'כהן', 'אוניברסיטת וושינגטון', 1, 1),
(155, '300987654', 'מיה', 'לוי', 'אוניברסיטת ניו יורק', 0, 1),
(156, '200123789', 'יעקב', 'ברזילי', 'אוניברסיטת טקסס', 1, 1),
(157, '300654321', 'שרה', 'גולדברג', 'אוניברסיטת ברקלי', 0, 1),
(158, '200456789', 'בנימין', 'פרידמן', 'אוניברסיטת אילינוי', 1, 1),
(159, '300876543', 'סופיה', 'אדלר', 'אוניברסיטת ויסקונסין-מדיסון', 0, 1),
(160, '200789456', 'לוגן', 'כהן', 'אוניברסיטת פנסילבניה', 1, 1),
(161, '300234567', 'מיה', 'רוזנבלום', 'אוניברסיטת פלורידה', 0, 1),
(162, '200987123', 'דניאל', 'רוזנטל', 'אוניברסיטת סותרן קליפורניה', 1, 1),
(163, '300345678', 'אביגיל', 'כהן', 'אוניברסיטת קליפורניה לוס אנג\'לס', 0, 1),
(164, '200876543', 'אלכסנדר', 'זלצר', 'אוניברסיטת מרילנד', 1, 1),
(165, '300987321', 'אביגיל', 'וינשטיין', 'אוניברסיטת וירג\'יניה', 0, 1),
(166, '200789654', 'דוד', 'שוורץ', 'אוניברסיטת קרולינה הצפונית', 1, 1),
(167, '300567891', 'סופיה', 'שטרית', 'אוניברסיטת קליפורניה סאן דייגו', 0, 1),
(168, '200234678', 'יוסף', 'רוזנטל', 'אוניברסיטת ג\'ורג\'יה', 1, 1),
(169, '300876912', 'שרלוט', 'אלפסי', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 1),
(170, '200345789', 'אליהו', 'קציר', 'אוניברסיטת איוה', 1, 1),
(171, '300654897', 'אווה', 'כהן', 'אוניברסיטת קליפורניה אירווין', 0, 1),
(172, '200789123', 'ויליאם', 'שמשון', 'אוניברסיטת אריזונה', 1, 1),
(173, '300987456', 'סקארלט', 'גבע', 'אוניברסיטת קולורדו בולדר', 0, 1),
(174, '200234567', 'יעקב', 'מלכה', 'אוניברסיטת וירג\'יניה', 1, 1),
(175, '300876543', 'מילה', 'רוזנבלט', 'אוניברסיטת קליפורניה דייויס', 0, 1),
(176, '200789654', 'מיכאל', 'כהן', 'אוניברסיטת אלבמה', 1, 1),
(177, '300567890', 'ויקטוריה', 'לוי', 'אוניברסיטת קליפורניה סנטה קרוז', 0, 1),
(178, '200345678', 'איתן', 'גולדשטיין', 'אוניברסיטת ויסקונסין-מדיסון', 1, 1),
(179, '300654897', 'אריה', 'אברמוביץ', 'אוניברסיטת קליפורניה ריברסייד', 0, 1),
(180, '200789123', 'דניאל', 'כהנא', 'אוניברסיטת קנטוקי', 1, 1),
(181, '300987456', 'סופי', 'אדלר', 'אוניברסיטת קליפורניה סן פרנסיסקו', 0, 1),
(182, '200234567', 'לוגן', 'רוזנברג', 'אוניברסיטת קונטיקט', 1, 1),
(183, '300876543', 'חנה', 'לוי', 'אוניברסיטת טקסס', 0, 1),
(184, '200789654', 'כריסטופר', 'גרוסמן', 'אוניברסיטת פיטסבורג', 1, 1),
(185, '300567890', 'נורה', 'אדלר', 'אוניברסיטת מילווקי', 0, 1),
(186, '200345678', 'אנדרו', 'שושנה', 'אוניברסיטת יוטה', 1, 1),
(187, '300654897', 'גרייס', 'פרנקל', 'אוניברסיטת קליפורניה סנטה ברברה', 0, 1),
(188, '200789123', 'יונתן', 'מלמד', 'אוניברסיטת קרולינה הדרומית', 1, 1),
(189, '300987456', 'אליזבת', 'לוי', 'אוניברסיטת קולורדו דנוור', 0, 1),
(190, '200234567', 'יעקב', 'שוורץ', 'אוניברסיטת איילנד', 1, 1),
(191, '300876543', 'ויקטוריה', 'שטיין', 'אוניברסיטת צינסינטי', 0, 1),
(192, '200789654', 'ישעיהו', 'פרלמן', 'אוניברסיטת דלאוור', 1, 1),
(193, '300567890', 'אברי', 'כהן', 'אוניברסיטת נברסקה', 0, 1),
(194, '200345678', 'יוספין', 'אברמוביץ', 'אוניברסיטת ניו מקסיקו', 1, 1),
(195, '300654897', 'נתן', 'שרון', 'אוניברסיטת נבדה', 0, 1),
(196, '200789123', 'ליאם', 'פרידמן', 'אוניברסיטת ניו המפשייר', 1, 1),
(197, '300987456', 'אלה', 'כהן', 'אוניברסיטת דקוטה הצפונית', 0, 1),
(198, '200234567', 'ניקולס', 'ברזילי', 'אוניברסיטת טקסס הצפונית', 1, 1),
(199, '300876543', 'מדיסון', 'שרון', 'אוניברסיטת אורגון', 0, 1),
(200, '200789654', 'הנרי', 'גולדברג', 'אוניברסיטת מיסיסיפי', 1, 1),
(201, '300567890', 'כלואי', 'כהן', 'אוניברסיטת אוקלהומה', 0, 1);

-- --------------------------------------------------------

--
-- Table structure for table `roles`
--

CREATE TABLE `roles` (
  `id` int(255) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `roles`
--

INSERT INTO `roles` (`id`, `name`) VALUES
(1, 'user'),
(2, 'admin'),
(3, 'super admin');

-- --------------------------------------------------------

--
-- Table structure for table `test`
--

CREATE TABLE `test` (
  `id` int(11) NOT NULL,
  `tz_id` varchar(255) DEFAULT NULL,
  `fName` varchar(255) DEFAULT NULL,
  `lName` varchar(255) DEFAULT NULL,
  `institute` varchar(255) DEFAULT NULL,
  `isArrived` int(11) DEFAULT NULL,
  `event_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `test`
--

INSERT INTO `test` (`id`, `tz_id`, `fName`, `lName`, `institute`, `isArrived`, `event_id`) VALUES
(1, '200454551', 'ינון', 'מרדכי', 'אוניברסיטת חיפה', 0, 3),
(2, '200585447', 'משה', 'נחום', 'טכניון', 0, 3),
(3, '301554887', 'אבי', 'טוביה', 'האוניברסיטה העברית', 0, 3);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(255) NOT NULL,
  `user_name` varchar(255) NOT NULL,
  `user_password` varchar(255) NOT NULL,
  `user_email` varchar(255) NOT NULL,
  `role` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `user_name`, `user_password`, `user_email`, `role`) VALUES
(1, 'ינון בר', '053508384', 'yinonbar1988@gmail.com', 3),
(2, 'ינון בר', '$2y$10$SBAYKIXy9VaFgeqvHUy1A..cHvZU90k3JKOVPk6wp8RpVLV87naxy', 'test@example.com', 2);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `dec_geo`
--
ALTER TABLE `dec_geo`
  ADD PRIMARY KEY (`id`),
  ADD KEY `mapping` (`event_id`);

--
-- Indexes for table `event_mapping`
--
ALTER TABLE `event_mapping`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `orientation_day`
--
ALTER TABLE `orientation_day`
  ADD PRIMARY KEY (`id`),
  ADD KEY `mapping` (`event_id`);

--
-- Indexes for table `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `test`
--
ALTER TABLE `test`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD KEY `role` (`role`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `dec_geo`
--
ALTER TABLE `dec_geo`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=274;

--
-- AUTO_INCREMENT for table `event_mapping`
--
ALTER TABLE `event_mapping`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `orientation_day`
--
ALTER TABLE `orientation_day`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=202;

--
-- AUTO_INCREMENT for table `roles`
--
ALTER TABLE `roles`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `test`
--
ALTER TABLE `test`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `dec_geo`
--
ALTER TABLE `dec_geo`
  ADD CONSTRAINT `mapping` FOREIGN KEY (`event_id`) REFERENCES `event_mapping` (`id`);

--
-- Constraints for table `users`
--
ALTER TABLE `users`
  ADD CONSTRAINT `role` FOREIGN KEY (`role`) REFERENCES `roles` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
